import React from 'react';
import Members from '../members/members';
import pic1 from '../../assets/images/campaign.jpg';

const About = () => {
    return (
        <>
        <div className='grid grid-cols-1 md:grid-cols-2 bg-green-100 border-black'>
        <div className='bg-gray-100 my-16 mx-32 p-8 rounded-3xl'>
        لورم ایپسوم یا طرح‌نما  به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد. معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است. از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به پایان برند.
        </div>
        <div className='bg-gray-100 my-16 mx-32 p-8 rounded-3xl'>
        لورم ایپسوم یا طرح‌نما  به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد. معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته شده‌است. از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا مرحله طراحی و صفحه‌بندی را به پایان برند.
        </div>  
        </div>
        <div className='bg-green-100 py-16'>
            <div className='bg-blue-400 w-64 mx-auto p-4 rounded-full font-bold text-xl'>اعضای شرکت</div>
            </div>
        <div className='grid grid-cols-1 gap-y-32 place-items-center md:grid-cols-3 bg-green-100'>

            <Members pic={pic1} name={'نام و نام خانوادگی'} position={'مدیر'}/>
            <Members pic={pic1} name={'نام و نام خانوادگی'} position={'مدیر'}/>
            <Members pic={pic1} name={'نام و نام خانوادگی'} position={'مدیر'}/>
            <Members pic={pic1} name={'نام و نام خانوادگی'} position={'مدیر'}/>
            <Members pic={pic1} name={'نام و نام خانوادگی'} position={'مدیر'}/>
            <Members pic={pic1} name={'نام و نام خانوادگی'} position={'مدیر'}/>
           
        </div>
        </>
    );
};

export default About;